;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

;; for personal gitlab
(package! org-super-agenda)
;(package! markdown-mode+)
(package! org-download)
(package! deft)
(package! ox-pandoc)
(package! ob-ipython)
(package! bog)
(package! pretty-symbols)
(package! hercules)
(package! helm-chrome)
(package! helm-addressbook)
(package! helm-rg)
(package! helm-aws)
(package! helm-bibtex)
(package! helm-books)
(package! helm-commandlinefu)
(package! helm-org)
;;(package! org-cliplink)
;;(package! hledger-mode)
;;(package! org-pdf-tools)
(package! grip-mode)
(package! deadgrep)
(package! org-brain)
(package! elfeed)
(package! elfeed-org)
(package! org-journal)
