;; Roam Packages
(package! org-roam)
(package! company-org-roam)
(package! org-roam-server)
;; Alphapapa packages
(package! helm-org-rifle)
(package! org-super-agenda)
(package! visual-fill-column)
(package! org-sidebar)
(package! org-ql)
(package! org-web-tools)
;; Themes
(package! chocolate-theme)
(unpin! doom-themes)
;; Orgmode Packages
(package! org-analyzer)
(package! org-edna)
(package! literate-calc-mode)
(package! ftable
  :recipe (:host github :repo "casouri/ftable"))
;; Python
(package! ob-ipython)
(package! anaconda-mode)
(package! company-anaconda)
;; Misc Packages
(package! company-manually)
(package! dimmer)
(package! elfeed)
(package! elfeed-org)
(package! ob-mermaid)
(package! mermaid-mode)
(package! ox-reveal)
(package! ox-pandoc)
(package! ox-twbs)
(package! gnuplot)
(package! gnuplot-mode)
(package! deadgrep)
(package! graphviz-dot-mode)
